experiment-finetuned/all_finetuned/runs/forwardStep/2/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.1 0 0);
    }

    outlet
    {
        type            waveTransmissive;
        field           U;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        (1.1 0 0);
        lInf            1;
        value           uniform (1.1 0 0);
    }

    bottom
    {
        type            symmetryPlane;
    }

    top
    {
        type            symmetryPlane;
    }

    obstacle
    {
        type            slip;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //